In [ ]:
https://www.w3resource.com/python-exercises/pandas/index-dataframe.php

In [ ]:
# 1. Write a Pandas program to get the powers of an array values element-wise.

In [14]:
import pandas as pd
import numpy as np

In [4]:
sample_data = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
sample_data

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [ ]:
# 2. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index 
#labels.

In [9]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, 'np.nan', 9, 20, 14.5, 'np.nan', 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
                         
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [11]:
exam_status = pd.DataFrame(exam_data, labels)
exam_status

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no
e      Emily       9         2      no
f    Michael      20         3     yes
g    Matthew    14.5         1     yes
h      Laura  np.nan         1      no
i      Kevin       8         2      no
j      Jonas      19         1     yes

In [ ]:
#3. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data

In [12]:
exam_status.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       10 non-null object
attempts    10 non-null int64
qualify     10 non-null object
dtypes: int64(1), object(3)
memory usage: 400.0+ bytes

In [13]:
exam_status.describe()

        attempts
count  10.000000
mean    1.900000
std     0.875595
min     1.000000
25%     1.000000
50%     2.000000
75%     2.750000
max     3.000000

In [ ]:
#4. Write a Pandas program to get the first 3 rows of a given DataFrame

In [15]:
exam_status.head(4)

        name   score  attempts qualify
a  Anastasia    12.5         1     yes
b       Dima       9         3      no
c  Katherine    16.5         2     yes
d      James  np.nan         3      no

In [ ]:
#5. Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame

In [18]:
exam_status.iloc[:,0:2]

        name   score
a  Anastasia    12.5
b       Dima       9
c  Katherine    16.5
d      James  np.nan
e      Emily       9
f    Michael      20
g    Matthew    14.5
h      Laura  np.nan
i      Kevin       8
j      Jonas      19

In [ ]:
#6.Write a Pandas program to select the specified columns and rows from a given data frame.

In [20]:
exam_status.iloc[1:9:2, 0:2]

      name   score
b     Dima       9
d    James  np.nan
f  Michael      20
h    Laura  np.nan

In [ ]:
#7. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [26]:
exam_status.loc[exam_status['attempts'] > 2].iloc[:,0:2]

      name   score
b     Dima       9
d    James  np.nan
f  Michael      20

In [ ]:
#8. Write a Pandas program to count the number of rows and columns of a DataFrame.

In [29]:
len(exam_status.count(axis = 'rows'))

4

In [30]:
len(exam_status.count(axis = 'columns'))

10

In [ ]:
#9. Write a Pandas program to select the rows where the score is missing, i.e. is NaN

In [33]:
exam_status.loc[exam_status['score'] == 'np.nan'].iloc[:,0:2]

    name   score
d  James  np.nan
h  Laura  np.nan

In [ ]:
#10. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [38]:
exam_status.loc[exam_status.apply(lambda x : True if x['score'] >= 15 and x['score'] <= 20 else False].iloc[:,0:2]

SyntaxError: invalid syntax (<ipython-input-38-1c60b154f3d5>, line 1)